In [1]:
import pandas as pd

In [3]:
df=pd.read_excel('D:\Data_Analysis\data\Event Registration (Responses).xlsx')

In [4]:
df.head()

                     Name Batch Branch Registration No. / Roll no.
0          Abhishek Kumar  2k22    EEE                  22110117008
1         Abhishek Kumar   2k22    CSE                  22105117024
2         Abhishek Kumar   2k22    CSE                  22105117033
3         Abhishek Kumar   2k22    CSE                  22105117003
4  Abhishek Kumar Sadhan   2k22    EEE                  22110117013